In [ ]:
#author: Roja_Achary

In [4]:
import numpy as np

In [5]:
import pandas as pd

In [8]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [9]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [10]:
dates = pd.date_range("20130101", periods=6)

In [11]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [13]:
df

                   A         B         C         D
2013-01-01 -0.660403 -0.104224  0.385185  0.738500
2013-01-02 -1.406033 -0.811804  0.134133 -1.498537
2013-01-03  1.258945 -1.041408  0.507907 -0.036210
2013-01-04 -0.032442  0.269865 -0.835087 -0.214461
2013-01-05 -0.046180 -1.534910 -0.343570  0.003510
2013-01-06 -0.214075  1.485695  0.196018  1.871626

In [22]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train","test","train"]),
        "F": "foo",
    }
)

In [23]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [24]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [28]:
df.head()

                   A         B         C         D
2013-01-01 -0.660403 -0.104224  0.385185  0.738500
2013-01-02 -1.406033 -0.811804  0.134133 -1.498537
2013-01-03  1.258945 -1.041408  0.507907 -0.036210
2013-01-04 -0.032442  0.269865 -0.835087 -0.214461
2013-01-05 -0.046180 -1.534910 -0.343570  0.003510

In [29]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.032442  0.269865 -0.835087 -0.214461
2013-01-05 -0.046180 -1.534910 -0.343570  0.003510
2013-01-06 -0.214075  1.485695  0.196018  1.871626

In [30]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [31]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [32]:
df.to_numpy()

array([[-0.66040323, -0.1042239 ,  0.38518501,  0.73850043],
       [-1.40603308, -0.81180371,  0.13413329, -1.49853724],
       [ 1.25894545, -1.04140764,  0.5079071 , -0.03621016],
       [-0.03244232,  0.26986546, -0.83508664, -0.21446052],
       [-0.04618   , -1.53491009, -0.34356985,  0.00351009],
       [-0.21407455,  1.48569511,  0.19601845,  1.87162591]])

In [33]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [34]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.183365 -0.289464  0.007431  0.144071
std    0.876959  1.085149  0.505535  1.115057
min   -1.406033 -1.534910 -0.835087 -1.498537
25%   -0.548821 -0.984007 -0.224144 -0.169898
50%   -0.130127 -0.458014  0.165076 -0.016350
75%   -0.035877  0.176343  0.337893  0.554753
max    1.258945  1.485695  0.507907  1.871626

In [35]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.660403   -1.406033    1.258945   -0.032442    -0.04618   -0.214075
B   -0.104224   -0.811804   -1.041408    0.269865    -1.53491    1.485695
C    0.385185    0.134133    0.507907   -0.835087    -0.34357    0.196018
D    0.738500   -1.498537   -0.036210   -0.214461     0.00351    1.871626

In [36]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.738500  0.385185 -0.104224 -0.660403
2013-01-02 -1.498537  0.134133 -0.811804 -1.406033
2013-01-03 -0.036210  0.507907 -1.041408  1.258945
2013-01-04 -0.214461 -0.835087  0.269865 -0.032442
2013-01-05  0.003510 -0.343570 -1.534910 -0.046180
2013-01-06  1.871626  0.196018  1.485695 -0.214075

In [37]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-05 -0.046180 -1.534910 -0.343570  0.003510
2013-01-03  1.258945 -1.041408  0.507907 -0.036210
2013-01-02 -1.406033 -0.811804  0.134133 -1.498537
2013-01-01 -0.660403 -0.104224  0.385185  0.738500
2013-01-04 -0.032442  0.269865 -0.835087 -0.214461
2013-01-06 -0.214075  1.485695  0.196018  1.871626

In [38]:
df["A"]

2013-01-01   -0.660403
2013-01-02   -1.406033
2013-01-03    1.258945
2013-01-04   -0.032442
2013-01-05   -0.046180
2013-01-06   -0.214075
Freq: D, Name: A, dtype: float64

In [39]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.660403 -0.104224  0.385185  0.738500
2013-01-02 -1.406033 -0.811804  0.134133 -1.498537
2013-01-03  1.258945 -1.041408  0.507907 -0.036210

In [40]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -1.406033 -0.811804  0.134133 -1.498537
2013-01-03  1.258945 -1.041408  0.507907 -0.036210
2013-01-04 -0.032442  0.269865 -0.835087 -0.214461

In [41]:
df.loc[dates[0]]

A   -0.660403
B   -0.104224
C    0.385185
D    0.738500
Name: 2013-01-01 00:00:00, dtype: float64

In [42]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -0.660403 -0.104224
2013-01-02 -1.406033 -0.811804
2013-01-03  1.258945 -1.041408
2013-01-04 -0.032442  0.269865
2013-01-05 -0.046180 -1.534910
2013-01-06 -0.214075  1.485695

In [43]:
df.loc["20130102":"20130104",["A","B"]]

                   A         B
2013-01-02 -1.406033 -0.811804
2013-01-03  1.258945 -1.041408
2013-01-04 -0.032442  0.269865

In [44]:
df.loc["20130102", ["A", "B"]]

A   -1.406033
B   -0.811804
Name: 2013-01-02 00:00:00, dtype: float64

In [45]:
df.loc[dates[0], "A"]

-0.6604032312326896

In [46]:
df.at[dates[0], "A"]

-0.6604032312326896

In [47]:
df.iloc[3]

A   -0.032442
B    0.269865
C   -0.835087
D   -0.214461
Name: 2013-01-04 00:00:00, dtype: float64

In [48]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.032442  0.269865
2013-01-05 -0.046180 -1.534910

In [49]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -1.406033  0.134133
2013-01-03  1.258945  0.507907
2013-01-05 -0.046180 -0.343570

In [50]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -1.406033 -0.811804  0.134133 -1.498537
2013-01-03  1.258945 -1.041408  0.507907 -0.036210

In [51]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.104224  0.385185
2013-01-02 -0.811804  0.134133
2013-01-03 -1.041408  0.507907
2013-01-04  0.269865 -0.835087
2013-01-05 -1.534910 -0.343570
2013-01-06  1.485695  0.196018

In [52]:
df.iloc[1, 1]

-0.8118037067177647

In [53]:
df.iat[1, 1]

-0.8118037067177647

In [54]:
df[df["A"] > 0]

                   A         B         C        D
2013-01-03  1.258945 -1.041408  0.507907 -0.03621

In [55]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.385185  0.738500
2013-01-02       NaN       NaN  0.134133       NaN
2013-01-03  1.258945       NaN  0.507907       NaN
2013-01-04       NaN  0.269865       NaN       NaN
2013-01-05       NaN       NaN       NaN  0.003510
2013-01-06       NaN  1.485695  0.196018  1.871626

In [57]:
df2 = df.copy()

In [58]:
df2["E"] = ["one", "one", "two", "three", "four", "three" ]

In [59]:
df2

                   A         B         C         D      E
2013-01-01 -0.660403 -0.104224  0.385185  0.738500    one
2013-01-02 -1.406033 -0.811804  0.134133 -1.498537    one
2013-01-03  1.258945 -1.041408  0.507907 -0.036210    two
2013-01-04 -0.032442  0.269865 -0.835087 -0.214461  three
2013-01-05 -0.046180 -1.534910 -0.343570  0.003510   four
2013-01-06 -0.214075  1.485695  0.196018  1.871626  three

In [60]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C        D     E
2013-01-03  1.258945 -1.041408  0.507907 -0.03621   two
2013-01-05 -0.046180 -1.534910 -0.343570  0.00351  four

In [61]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [62]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [63]:
df["F"] = s1

In [64]:
df.at[dates[0], "A"] = 0

In [65]:
df.iat[0, 1] = 0

In [66]:
df.loc[:, "D"] = np.array([5] * len(df))

In [67]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.385185  5  NaN
2013-01-02 -1.406033 -0.811804  0.134133  5  1.0
2013-01-03  1.258945 -1.041408  0.507907  5  2.0
2013-01-04 -0.032442  0.269865 -0.835087  5  3.0
2013-01-05 -0.046180 -1.534910 -0.343570  5  4.0
2013-01-06 -0.214075  1.485695  0.196018  5  5.0

In [68]:
df2 = df.copy()

In [69]:
df2[df2 > 0] = -df2

In [70]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.385185 -5  NaN
2013-01-02 -1.406033 -0.811804 -0.134133 -5 -1.0
2013-01-03 -1.258945 -1.041408 -0.507907 -5 -2.0
2013-01-04 -0.032442 -0.269865 -0.835087 -5 -3.0
2013-01-05 -0.046180 -1.534910 -0.343570 -5 -4.0
2013-01-06 -0.214075 -1.485695 -0.196018 -5 -5.0

In [71]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [72]:
df1.loc[dates[0] : dates[1], "E"] = 1

In [73]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.385185  5  NaN  1.0
2013-01-02 -1.406033 -0.811804  0.134133  5  1.0  1.0
2013-01-03  1.258945 -1.041408  0.507907  5  2.0  NaN
2013-01-04 -0.032442  0.269865 -0.835087  5  3.0  NaN

In [74]:
df1.dropna(how="any")

                   A         B         C  D    F    E
2013-01-02 -1.406033 -0.811804  0.134133  5  1.0  1.0

In [75]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.385185  5  5.0  1.0
2013-01-02 -1.406033 -0.811804  0.134133  5  1.0  1.0
2013-01-03  1.258945 -1.041408  0.507907  5  2.0  5.0
2013-01-04 -0.032442  0.269865 -0.835087  5  3.0  5.0

In [76]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [77]:
df.mean()

A   -0.073297
B   -0.272093
C    0.007431
D    5.000000
F    3.000000
dtype: float64

In [78]:
df.mean(1)

2013-01-01    1.346296
2013-01-02    0.783259
2013-01-03    1.545089
2013-01-04    1.480467
2013-01-05    1.415068
2013-01-06    2.293528
Freq: D, dtype: float64

In [79]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [80]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [81]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  0.258945 -2.041408 -0.492093  4.0  1.0
2013-01-04 -3.032442 -2.730135 -3.835087  2.0  0.0
2013-01-05 -5.046180 -6.534910 -5.343570  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [82]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.385185   5   NaN
2013-01-02 -1.406033 -0.811804  0.519318  10   1.0
2013-01-03 -0.147088 -1.853211  1.027225  15   3.0
2013-01-04 -0.179530 -1.583346  0.192139  20   6.0
2013-01-05 -0.225710 -3.118256 -0.151431  25  10.0
2013-01-06 -0.439784 -1.632561  0.044587  30  15.0

In [83]:
df.apply(lambda x: x.max() - x.min())

A    2.664979
B    3.020605
C    1.342994
D    0.000000
F    4.000000
dtype: float64

In [84]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [85]:
s

0    0
1    5
2    6
3    3
4    2
5    4
6    5
7    4
8    3
9    5
dtype: int32

In [86]:
s.value_counts()

5    3
4    2
3    2
6    1
2    1
0    1
dtype: int64